### Building a Mechine learning Model to Predict Titanic Disaster Servivers  
- Understand the Dataset & cleanup (if required).
- Build a strong classification model to predict whether the passenger survives or not.
- Also fine-tune the hyperparameters & compare the evaluation metrics of various classification algorithms.

In [86]:
# import Nessosery Librarys
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Model 
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn import svm

# Model Evaluation 
from sklearn.model_selection import train_test_split, cross_val_score
from sklearn.metrics import accuracy_score, precision_score, recall_score, f1_score
from sklearn.metrics import classification_report

In [87]:
titanic_df = pd.read_csv("Data/Titanic-Dataset.csv")
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [88]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [89]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Dataset hase **missing values** and the **strings** in it we need to work on it before the **exploretory data analysis**.

In [90]:
# The Passenger names are Ex : Braund, Mr. Owen Harris and the models can't undestand the strings in the datset
# we need to make it that the models can undestand 
# and the full names of the passenger it not usefull for the model training 
# but the titles of the passengers : Mr, Miss, Mrs, Master are crutual for model to undestand the servival rete of each passenger
# we need to extract them and add them back to the main DataFrame
# in the dataset the titles are between first coma and fullstop, 
# we can get the title by using that 

# work with Lambda to extract the titles 
titanic_df["Title"] = titanic_df["Name"].apply(lambda x : x.split(',')[1].split('.')[0].strip())
titanic_df.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  Title
0            1         0       3  ...   NaN        S     Mr
1            2         1       1  ...   C85        C    Mrs
2            3         1       3  ...   NaN        S   Miss
3            4         1       1  ...  C123        S    Mrs
4            5         0       3  ...   NaN        S     Mr

[5 rows x 13 columns]

In [91]:
titanic_df = titanic_df.drop("Name", axis=1)

In [92]:
titanic_df.head()

   PassengerId  Survived  Pclass     Sex  ...     Fare  Cabin  Embarked Title
0            1         0       3    male  ...   7.2500    NaN         S    Mr
1            2         1       1  female  ...  71.2833    C85         C   Mrs
2            3         1       3  female  ...   7.9250    NaN         S  Miss
3            4         1       1  female  ...  53.1000   C123         S   Mrs
4            5         0       3    male  ...   8.0500    NaN         S    Mr

[5 rows x 12 columns]

In [93]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Title        891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [94]:
# because of high missing values in the Cabin feature i am droping the column 
# it hase 71 % of missing values
titanic_df = titanic_df.drop("Cabin", axis=1)

In [95]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare  Embarked  Title
0            1         0       3  ...   7.2500         S     Mr
1            2         1       1  ...  71.2833         C    Mrs
2            3         1       3  ...   7.9250         S   Miss
3            4         1       1  ...  53.1000         S    Mrs
4            5         0       3  ...   8.0500         S     Mr

[5 rows x 11 columns]

In [96]:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
Title            0
dtype: int64

In [97]:
# The Ticket feature hase almost 600 different values it will couse some issues with the model acuracy 
# so i am droping the Ticket feature 
titanic_df = titanic_df.drop("Ticket", axis=1)
titanic_df

     PassengerId  Survived  Pclass     Sex  ...  Parch     Fare  Embarked  Title
0              1         0       3    male  ...      0   7.2500         S     Mr
1              2         1       1  female  ...      0  71.2833         C    Mrs
2              3         1       3  female  ...      0   7.9250         S   Miss
3              4         1       1  female  ...      0  53.1000         S    Mrs
4              5         0       3    male  ...      0   8.0500         S     Mr
..           ...       ...     ...     ...  ...    ...      ...       ...    ...
886          887         0       2    male  ...      0  13.0000         S    Rev
887          888         1       1  female  ...      0  30.0000         S   Miss
888          889         0       3  female  ...      2  23.4500         S   Miss
889          890         1       1    male  ...      0  30.0000         C     Mr
890          891         0       3    male  ...      0   7.7500         Q     Mr

[891 rows x 10 columns]

In [98]:
# Transform the Sex Feature to a int from object 

titanic_df['Sex'], _ = pd.factorize(titanic_df['Sex'])
titanic_df

     PassengerId  Survived  Pclass  Sex  ...  Parch     Fare  Embarked  Title
0              1         0       3    0  ...      0   7.2500         S     Mr
1              2         1       1    1  ...      0  71.2833         C    Mrs
2              3         1       3    1  ...      0   7.9250         S   Miss
3              4         1       1    1  ...      0  53.1000         S    Mrs
4              5         0       3    0  ...      0   8.0500         S     Mr
..           ...       ...     ...  ...  ...    ...      ...       ...    ...
886          887         0       2    0  ...      0  13.0000         S    Rev
887          888         1       1    1  ...      0  30.0000         S   Miss
888          889         0       3    1  ...      2  23.4500         S   Miss
889          890         1       1    0  ...      0  30.0000         C     Mr
890          891         0       3    0  ...      0   7.7500         Q     Mr

[891 rows x 10 columns]

In [99]:
# Transform Title feature column
titanic_df['Title'], _ = pd.factorize(titanic_df['Title'])
titanic_df

     PassengerId  Survived  Pclass  Sex  ...  Parch     Fare  Embarked  Title
0              1         0       3    0  ...      0   7.2500         S      0
1              2         1       1    1  ...      0  71.2833         C      1
2              3         1       3    1  ...      0   7.9250         S      2
3              4         1       1    1  ...      0  53.1000         S      1
4              5         0       3    0  ...      0   8.0500         S      0
..           ...       ...     ...  ...  ...    ...      ...       ...    ...
886          887         0       2    0  ...      0  13.0000         S      5
887          888         1       1    1  ...      0  30.0000         S      2
888          889         0       3    1  ...      2  23.4500         S      2
889          890         1       1    0  ...      0  30.0000         C      0
890          891         0       3    0  ...      0   7.7500         Q      0

[891 rows x 10 columns]

In [100]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    int64
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Fare         891 non-null    float64
 8   Embarked     889 non-null    object
 9   Title        891 non-null    int64
dtypes: float64(2), int64(7), object(1)
memory usage: 69.7+ KB

In [103]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
Title            0
dtype: int64